revytechinc/freebsd-src-nested-vm/share/man/man9/vmm_nested.9
.\" Copyright (c) 2026 FreeBSD Project Contributors
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd July 31, 2026
.Dt VMM_NESTED 9
.Os
.Sh NAME
.Nm vmm_nested
.Nd "nested virtualization support for bhyve hypervisor"
.Sh SYNOPSIS
.In sys/vmm.h
.Ft int
.Fn vm_create "const char *name"
.Pp
To enable at boot, add the following line to
.Xr loader.conf 5 :
.Bd -literal -offset indent
hw.vmm.nested.enable=1
.Ed
.Pp
The same value may also be written to the sysctl at runtime:
.Bd -literal -offset indent
sysctl hw.vmm.nested.enable=1
.Ed
.Sh DESCRIPTION
The
.Nm
facility lets
.Xr bhyve 8
expose hardware-assisted CPU virtualization to its guests, so a
level-1 (L1) guest can in turn run its own level-2 (L2) virtual
machines.
Each virtual machine created through
.Xr vmm 9
carries a per-VM
.Va nested_enabled
flag; the flag is set only when the machine is opened through the
nested-aware interface described below.
.Pp
The feature is gated behind the
.Va hw.vmm.nested.enable
sysctl, which defaults to 0 (off).
The sysctl is consumed at boot from
.Xr loader.conf 5
and may be toggled at runtime through
.Xr sysctl 8 .
While the sysctl reads 0, the kernel takes no extra branches and no
extra memory is reserved for nested VMCS or VMCB shadow state, so the
fast path of existing bhyve guests is identical to a build without the
facility.
.Pp
Two new kernel interfaces are introduced to opt in to nested mode.
The kernel ioctl
.Dv VMMCTL_CREATE_NESTED
allows
.Xr vmm 9
to construct a VM with the
.Va nested_enabled
flag set in the per-VM structure, and the libvmmapi client flag
.Dv VMMAPI_OPEN_CREATE_NESTED
performs the equivalent opt-in when calling
.Xr vm_create 3
(or any wrapper that ultimately opens the VM).
Both interfaces return the regular
.Xr vm_create 3
contract on success; the only difference is the negotiated capability
set of the resulting VM.
The per-VM flag is the single source of truth at run time, so a VM
created through the legacy ioctl never sees nested code paths even
if the sysctl is left on.
.Pp
When the sysctl is non-zero and the per-VM flag is set, the L1 hypervisor
translates VMX or SVM intercepts emitted by an L2 guest into the
corresponding L0 operations on the underlying hardware.
The translation layer is designed so that no host VMCS or host VMCB
state is exposed to the L1 guest and no L1-controlled memory is
mapped into host structures.
Isolation between L1 guests is enforced through the existing second-level
address translation pipeline (Intel EPT or AMD NPT), not through any new
shared host state.
.Pp
The facility is experimental.
It does not yet cover live migration of nested VMs, IOMMU virtualization,
Last Branch Record virtualization, SMM virtualization, or any code
derived from GPL-licensed hypervisors; those topics are tracked by
separate later tasks and their own MFCs.
Programs that depend on those features should not enable the sysctl.
.Sh SEE ALSO
.Xr vm_create 3 ,
.Xr vmm 4 ,
.Xr loader.conf 5 ,
.Xr bhyve 8 ,
.Xr sysctl 8 ,
.Xr vmm 9
.Sh HISTORY
.Nm
first appeared in
.Fx 17.0 .
Initial documentation skeleton introduced as part of the nested
virtualization work-in-progress; the ioctl and libvmmapi constants
documented here are defined in their respective task MFCs.
.Sh AUTHORS
.An -nosplit
This manual page was written by the
.An .Sy nested-virt
project contributors.
